// 中国地级市数据，按拼音首字母分类
module.exports = {
  cityList: [
    {
      initial: 'A',
      cities: ['阿克苏', '阿拉善', '安康', '安庆', '安顺', '安阳', '鞍山']
    },
    {
      initial: 'B',
      cities: ['百色', '白城', '白山', '白银', '保定', '宝鸡', '包头', '巴中', '北海', '北京', '蚌埠', '本溪', '滨州', '亳州']
    },
    {
      initial: 'C',
      cities: ['沧州', '长春', '长沙', '长治', '常德', '常州', '巢湖', '朝阳', '潮州', '承德', '成都', '赤峰', '池州', '重庆', '崇左', '滁州']
    },
    {
      initial: 'D',
      cities: ['大连', '大庆', '大同', '丹东', '德阳', '德州', '东莞', '东营', '都匀']
    },
    {
      initial: 'E',
      cities: ['鄂尔多斯', '鄂州']
    },
    {
      initial: 'F',
      cities: ['防城港', '佛山', '抚顺', '抚州', '阜新', '阜阳', '福州']
    },
    {
      initial: 'G',
      cities: ['甘南', '赣州', '固原', '广安', '广元', '广州', '贵港', '贵阳', '桂林']
    },
    {
      initial: 'H',
      cities: ['哈尔滨', '海口', '邯郸', '汉中', '杭州', '合肥', '河池', '河源', '菏泽', '贺州', '鹤壁', '鹤岗', '黑河', '衡水', '衡阳', '红河', '呼和浩特', '呼伦贝尔', '湖州', '葫芦岛', '惠州', '淮安', '淮北', '淮南', '黄冈', '黄山', '黄石']
    },
    {
      initial: 'J',
      cities: ['济南', '济宁', '加格达奇', '佳木斯', '吉安', '吉林', '即墨', '集安', '嘉兴', '嘉峪关', '江门', '焦作', '揭阳', '金昌', '金华', '锦州', '晋城', '晋中', '荆门', '荆州', '景德镇', '九江']
    },
    {
      initial: 'K',
      cities: ['开封', '克拉玛依', '昆明']
    },
    {
      initial: 'L',
      cities: ['来宾', '莱芜', '廊坊', '兰州', '拉萨', '乐山', '丽江', '丽水', '连云港', '辽阳', '辽源', '聊城', '临沧', '临汾', '临沂', '柳州', '六安', '六盘水', '龙岩', '陇南', '娄底', '泸州', '吕梁', '洛阳', '漯河']
    },
    {
      initial: 'M',
      cities: ['马鞍山', '茂名', '眉山', '梅州', '绵阳', '牡丹江']
    },
    {
      initial: 'N',
      cities: ['南昌', '南充', '南京', '南宁', '南平', '南通', '南阳', '内江', '宁波', '宁德']
    },
    {
      initial: 'P',
      cities: ['盘锦', '攀枝花', '平顶山', '平凉', '萍乡', '莆田', '濮阳']
    },
    {
      initial: 'Q',
      cities: ['青岛', '清远', '秦皇岛', '钦州', '齐齐哈尔', '泉州', '曲靖', '衢州']
    },
    {
      initial: 'R',
      cities: ['日照']
    },
    {
      initial: 'S',
      cities: ['三门峡', '三明', '三亚', '上海', '上饶', '韶关', '绍兴', '邵阳', '汕头', '汕尾', '商洛', '商丘', '深圳', '沈阳', '十堰', '石家庄', '石嘴山', '双鸭山', '朔州', '四平', '松原', '苏州', '宿迁', '宿州', '绥化']
    },
    {
      initial: 'T',
      cities: ['泰安', '太原', '泰州', '台州', '唐山', '天津', '天水', '铁岭', '通化', '通辽', '铜川', '铜陵']
    },
    {
      initial: 'W',
      cities: ['威海', '潍坊', '渭南', '温州', '乌海', '乌兰察布', '乌鲁木齐', '无锡', '芜湖', '吴忠', '武汉', '武威']
    },
    {
      initial: 'X',
      cities: ['厦门', '西安', '西宁', '锡林郭勒', '咸宁', '咸阳', '湘潭', '襄阳', '孝感', '忻州', '新乡', '新余', '信阳', '兴安', '邢台', '徐州', '许昌', '宣城']
    },
    {
      initial: 'Y',
      cities: ['雅安', '烟台', '延安', '盐城', '扬州', '阳江', '阳泉', '伊春', '伊犁', '宜宾', '宜昌', '宜春', '益阳', '银川', '营口', '永州', '玉林', '玉溪', '岳阳', '云浮', '运城']
    },
    {
      initial: 'Z',
      cities: ['枣庄', '湛江', '张家界', '张家口', '张掖', '漳州', '昭通', '肇庆', '镇江', '郑州', '中山', '中卫', '舟山', '周口', '珠海', '株洲', '驻马店', '资阳', '淄博', '自贡', '遵义']
    }
  ]
};